app/Controllers/Auth.php

SELECT *
FROM "users"
WHERE "username" = 'admin'
 LIMIT 1
---
    public function doLogin()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $userModel = new UserModel();
        $user = $userModel->where('username', $username)->first();