app/Controllers/Barang.php

SELECT *
FROM "barang"
---
    public function index()
    {
        $data['barangList'] = $this->barangModel->findAll();