app/Controllers/Laporan.php

    public function index()
    {
        $data['barangMasukList'] = $this->barangMasukModel
            ->select('barang_masuk.*, barang.kode_barang, barang.nama_barang')
            ->join('barang', 'barang.id = barang_masuk.barang_id', 'left')
            ->orderBy('barang_masuk.tanggal', 'DESC')
            ->findAll();

        $data['barangKeluarList'] = $this->barangKeluarModel
            ->select('barang_keluar.*, barang.kode_barang, barang.nama_barang')
            ->join('barang', 'barang.id = barang_keluar.barang_id', 'left')
            ->orderBy('barang_keluar.tanggal', 'DESC')
            ->findAll();
---
SELECT "barang_masuk".*, "barang"."kode_barang", "barang"."nama_barang"
FROM "barang_masuk"
LEFT JOIN "barang" ON "barang"."id" = "barang_masuk"."barang_id"
ORDER BY "barang_masuk"."tanggal" DESC
SELECT "barang_keluar".*, "barang"."kode_barang", "barang"."nama_barang"
FROM "barang_keluar"
LEFT JOIN "barang" ON "barang"."id" = "barang_keluar"."barang_id"
ORDER BY "barang_keluar"."tanggal" DESC