app/Controllers/Peminjaman.php

    public function create()
    {
        // Tampilkan form tambah peminjaman
        // Kalau perlu, kirim data barang untuk dropdown
        $barangModel = new \App\Models\BarangModel();
        $data['barangList'] = $barangModel->findAll();
---
SELECT *
FROM "barang"