app/Models/BarangMasukModel.php

    public function getBarangMasukWithBarang()
    {
        return $this->select('barang_masuk.*, barang.kode_barang, barang.nama_barang')
            ->join('barang', 'barang.id = barang_masuk.barang_id')
            ->orderBy('barang_masuk.tanggal', 'DESC')
            ->findAll();
---
SELECT "barang_masuk".*, "barang"."kode_barang", "barang"."nama_barang"
FROM "barang_masuk"
JOIN "barang" ON "barang"."id" = "barang_masuk"."barang_id"
ORDER BY "barang_masuk"."tanggal" DESC