app/Models/PeminjamanModel.php

SELECT "peminjaman".*, "barang"."nama_barang"
FROM "peminjaman"
LEFT JOIN barang ON barang.id::text = peminjaman.barang_id
ORDER BY "peminjaman"."id" ASC
---
    public function getPeminjamanBarang()
    {
        return $this->select('peminjaman.*, barang.nama_barang')
            ->join('barang', 'barang.id::text = peminjaman.barang_id', 'left', false)
            ->orderBy('peminjaman.id', 'ASC')
            ->findAll();

SELECT "peminjaman".*, "barang"."nama_barang"
FROM "peminjaman"
LEFT JOIN barang ON barang.id::text = peminjaman.barang_id
WHERE "peminjaman"."status" = 'dipinjam'
ORDER BY "peminjaman"."id" ASC
---
    public function getDipinjam()
    {
        return $this->select('peminjaman.*, barang.nama_barang')
            ->join('barang', 'barang.id::text = peminjaman.barang_id', 'left', false)
            ->where('peminjaman.status', 'dipinjam')
            ->orderBy('peminjaman.id', 'ASC')
            ->findAll();